[
  {
    "id": 1,
    "courseId": "2838360",
    "courseName": "微观经济学",
    "teacher": "高彧",
    "semester": "24秋",
    "publishDate": "2025-09-01",
    "overallScore": 5,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 5,
    "teaching": 5,
    "harvest": 5,
    "content": "老师人美心善，课程深入浅出，值得一选。\n\n课程内容：先进行引入，接下来依次推进消费者理论、风险理论、生产者理论、交换经济、博弈论。和 nsd 中微对比可以感受到老师真的很用心在打磨课堂内容，有很多有趣的小例子，比如博弈论章节玩了经典的“每个人在范围内报数，最接近平均数一半的人赢”的游戏，听说以前奖励是总评加分但被举报了所以今年没有x。每节课前 20min 左右会简单回顾，然后按照课前下发的 ppt 顺序讲解，没有要求使用课本。听感和课堂氛围都很好，主要是比较多概念的引入需要理解记忆，之后听课/期末复习需要花一些时间。没有回放，复习只能看 ppt。数学相关的知识只需要求导（和拉格朗日乘子法的应用，课上会简单教，不会也能感性理解一些做题需要的结论）。不需要前置的经济学知识，是很好的科普向课程。\n\n平时任务量：一学期一共五次作业，会安排两次（线上）习题课讲解，每次作业任务量 1~2h，但支持至多四人组队，鼓励组内讨论，声称根据作业正确率给分。作业难度并不大，细心完成会对课程内容理解和期末考试都有不错的帮助。\n\n考核：没有期中考试，作业:期末 = 4:6，期末在声称不会有原题的情况下出现了作业原题。难度基本在于读懂题然后就变成小学应用题。改卷比较松。每年都会申请超优秀率，今年在 65% 左右，优秀的给分都聚集在 95+。"
  },
  {
    "id": 2,
    "courseId": "2432210",
    "courseName": "民主的历史与现实",
    "teacher": "汪卫华",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 2,
    "difficulty": 4,
    "grading": 3,
    "teaching": 5,
    "harvest": 5,
    "content": "这门课是国际关系学院的专业课，也是二类通识核心课。课程内容就是民主的历史与现实，包括早期民主、代议制民主的兴起与扩散、民主与法治、民主与经济发展、民主与社会结构等内容。 考核方式： 20小组pre+30个人读书报告+50期末闭卷考试 小组pre的内容是导读并讨论The Decline and Rise of Democracy这本书。梳理书中内容，尝试提出、讨论问题即可，分到每个人的任务量不大，但是最好有所总结和思考。 个人读书报告也是在三本小书当中选择。汪老师给的书目都比较简短但是非常经典，读起来没有负担，同时有一定的挑战性。要求是一页纸，一到两面，尽量往少了写，反对无意义地卷字数。dz觉得在字数少的同时要写出内容其实更难，所以多写了一点，老师应该是比较宽容的。 闭卷考试有十道填空题和两道大题。往年题见7039951。填空题来源是《民主四讲》这本书。24-25年的第一道大题考了共同阅读书目的内容。但是因为小组人很多，可能有不少同学只阅读了自己负责的一节，对书目缺少整体把握，也没有重视、复习相关内容，所以这道题还是出人意料而且很有难度的。dz其实也只认真读了做pre相关的一章（全书1/3），但结合老师的讲解，基本也把这个题答上了。另一道题结合课堂笔记和自己的理解回答即可。老师期末会发PPT，但上课讲述的很多东西PPT上是没有的，还是需要认真听课记笔记。 成绩是严格按给分折算的，所以可能区分度会比较大。dz认真听课做笔记，读书做pre，同时很认真地进行了复习，最终总评92。 dz是某人文院系大三学生，此前对于政治学和社会科学完全没有了解，对国际关系有一点兴趣，但也只是在b站看看骁哥的电子地图册的程度。这门课是dz大学三年最喜欢、收获最大的课程之一，因为汪老师讲的太好了。课程知识密度极大，晚课连上三节，但完全舍不得玩手机，全程着急记笔记。老师的措辞、语速、逻辑都让人极度舒适。课..."
  },
  {
    "id": 3,
    "courseId": "1339180",
    "courseName": "世界文化地理",
    "teacher": "邓辉",
    "semester": "24秋",
    "publishDate": "2025-08-01",
    "overallScore": 4,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 5,
    "teaching": 5,
    "harvest": 3,
    "content": "【课程任务】有一定数量的考勤，但任务量很小。每节课后会在教学网上发布10道对应的课程习题（填空和选择形式，翻课本基本就能找到答案），期末前完成即可；除此之外就是两次千字以内的作业和开卷期末考试，难度都不大（对于开卷资料，除了笔记和课本以外，请一定要记得携带or打印地图册，会考地图） 【课堂氛围】课程包含文化和地理两部分，所以相对来说人文地理的篇幅会比自然地理更重，在人文地理部分老师会讲到一些有意思的故事与时事，大家的专注度明显更高；自然地理部分相对而言摸鱼的同学比较多。但每周上座率都挺高的，因为课程内容确实很有趣。 【个人感受】自然地理部分的难度基本上是高中地理知识，人文地理部分也不会太学术（而更偏向常识？），所以对高中选科地理的同学相当友好，基本上是复习加一点点的拓展。对于世界地理感兴趣的同学，应该也是很好上手的入门课。 【给分状况】好，在四类通识课里选就完事。"
  },
  {
    "id": 4,
    "courseId": "3232080",
    "courseName": "日本经济",
    "teacher": "宋磊",
    "semester": "24春",
    "publishDate": "2025-08-01",
    "overallScore": 4,
    "taskLoad": 1,
    "difficulty": 3,
    "grading": 3,
    "teaching": 3,
    "harvest": 4,
    "content": "【课程任务】记忆中似乎只有期中考试和期末考试，期中闭卷期末开卷，主要都是课上讲的知识，考察相对会比较细——平时任务量基本为0，但是期末周突击会有点累。 【课堂氛围】政管难得的好课。宋老师很幽默，讲课也很有趣不枯燥，日常拉踩某光某关也算每周必备了（虽然每次大家都会哄笑，起到一个调剂氛围的作用） 【个人感受】对日本社会或者经济学感兴趣的同学可以选，宋老师会日语，也会举很多具体的日本企业案例（还会请日本企业家来讲授一两节课），在通识课里算是很用心的了；经济学理论部分也讲得比较简明易懂，课上跟不上的地方，回去反复多看看笔记也能掌握得七七八八。唯一需要避雷的是开课教室在二教105，晚上在教室里呼吸沉积了一天的二氧化碳混暖气是灾难级别的体验…… 【给分状况】给分还是挺宽容的，没上优秀也基本会给正态；改革之后没有绩点压力的话更适合选。"
  },
  {
    "id": 5,
    "courseId": "4334017",
    "courseName": "美索不达米亚艺术与文明",
    "teacher": "贾妍",
    "semester": "25夏",
    "publishDate": "2025-09-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 4,
    "teaching": 5,
    "harvest": 4,
    "content": "【课程任务】20%课堂考勤+60%图录作业+20%期末开卷考试。暑校的课堂考勤还是比较频繁的，七天大概考勤了三次还是四次；图录作业是课堂随机抽取三张明信片，就每张明信片上的文物写文物介绍，1k字以内（字数要求低但是写起来还是比较费功夫的，主要是有些冷门文物比较难找到对应的资料和文献）；期末开卷考试是开放性试题，基本上沿着课上讲过的知识发挥、言之有理即可。 【课堂氛围】整体还是比较好的，jy老师讲课很有意思，在讲具体的文物or神话or艺术理论的时候都会把理论和实践结合，既会讲自己去实地考察的故事，也会列举生动浅明的例子，课堂整体听感像是在一场感兴趣的讲座。 【个人感受】jy老师不提供课件和课程资料（只提供了一些建议的阅读材料），也很反对售卖课程资料的行为，认为是对课堂的一种不尊重。所以真正要学到东西的话还是要自己上课认真听，dz出于个人习惯一直在拍拍拍记记记，但也总是不由自主地沉浸在讲课里就忘了记hhh不过后来才发现笔记固然重要（开卷要用），但通过听课接受熏陶才是通识课最值得享受、最有魅力的一部分。 【给分】统分洞差异比较明显，许多抱着刷分目的来选的同学分数没有很好，但是也有不少90+的同学。dz大概花了一周的时间认真写完了三篇图录，期末考试也洋洋洒洒写了蛮多，最后拿到了比较理想的分数。"
  },
  {
    "id": 6,
    "courseId": "2034300",
    "courseName": "大学国文",
    "teacher": "李林芳",
    "semester": "25春",
    "publishDate": "2025-06-01",
    "overallScore": 3,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 3,
    "teaching": 3,
    "harvest": 2,
    "content": "【考核方式】：0.4的作业（两个老师分别一次作业）0.6的期末考试 【课堂】：dz每节课都去，但没怎么听讲。没有签到。llf老师讲古代文学，基本是笔记、赋诗、校勘等等这些内容吧；fxl老师是语言学，讲一些用语之类的。llf老师ppt做的很好看，fxl老师讲课注重互动，但不是提问，而是有一些停顿和思考。对于没有中文兴趣的dz来说，听感一般。llf老师作业是分析段顾之争，fxl老师是“有点儿”这个词组的分析。我一个A，一个A+。 【考试】：四道简答题，一个作文。两道fxl老师的，会划考点，把考点全背下就能完全拿分。llf老师说不用复习，但dz还是看了他的回放，最后考了一个笔记，一个考文的。笔记的我有印象，写了七七八八，考文的应该是写错了。作文和高考作文一样。写完很累。 【给分】：正常，应该是考怎么样，分就怎么样。统分洞里基本都是【85,90】的，有一些人是90以上，可惜不是我aaaaaaa。 【推荐程度】：5/10"
  },
  {
    "id": 7,
    "courseId": "1630079",
    "courseName": "心理学导论",
    "teacher": "毛利华",
    "semester": "25春",
    "publishDate": "2025-07-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 4,
    "grading": 4,
    "teaching": 5,
    "harvest": 4,
    "content": "【心理学导论】心导 毛利华 mlh dz得分【90，95】 通识课，两学分 【考核方式】：0.05被试（参加即有分，基本上一两个小时的实验即可，我做的是助教组织的一个），0.1考勤（大家都有，每考勤过，第一次上课点过两三个同学回答问题吧，其他时候没点名过，因为课程内容多，中间不下课，也没空点名），0.35两次作业（一次0.15，一次0.2，形式丰富，论文视频都可以，我第一次视频第二次论文），平时分我是48/50。0.5的期末考试。 【课堂】：老师的课堂组织还有slides蛮好，有几节课我感兴趣，其余的有时候会陷入哲学。课堂人满为患。 【考试】：前面有十道选择题比较刁钻，很难做对。然后是六道名词解释，在135个名词中选6个，这个阶段在备考的时候还是很重要的，dz也在这个阶段学到了许多。然后是简答题，最后一个小问会赦免你的一道选择题（自己选题号），或者问你期望的分数之类的hh。我复习了两天，但期末没上90，后面的这些题都是背过的并且自我感觉良好。 【给分】：看统分洞基本都是90+的，95+的也不少，但也有正态、80-的，毕竟不可能所有人都优秀。 【推荐程度】：8/10"
  },
  {
    "id": 8,
    "courseId": "1630079",
    "courseName": "心理学导论",
    "teacher": "毛利华",
    "semester": "25春",
    "publishDate": "2025-07-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 4,
    "grading": 3,
    "teaching": 5,
    "harvest": 5,
    "content": "心理学导论/心导 毛利华 mlh 得分：【80,85） 一门从标题上看就非常有趣的好课。毛利华老师的授课水平很高，既幽默风趣又深挚真诚，尽管经常拖堂几分钟到十几分钟不等，但也让人十分陶醉。这是dz大一下学期听得最认真也是最投入的好课，但却也是得分断档最低的（）。课程有两次课堂作业（35%），一次被试（5%），白送考勤分数（10%）和期末考试（50%），尽管dz上课听得很认真，并且对于课上讲的东西自认为是基本完全吸收了，但是期末考的核心概念（163个）之中有约60%在课上并没有提到或者讲得很少，所以这也是一门教考分离比较严重的课（推荐阅读书目《心理学与生活》中确实都有这些概念，但是老师讲的章节里这些内容也并非都是重点，所以都列入期末考范围会造成一定的复习压力）。另外平时作业分dz得的很低，完成的态度是比较认真的，感觉也有自己的见解，可能是需要卷一下形式和字数，dz没有注意，算是交了学费。不同于一般交了作业就至少能得80-90%分数的课，心导的作业可能区分度还比较大，这一点想要得高分的同学要注意，可以做得更有创意或者写成规范完整的论文形式。期末考的难度比较适中，能够忠实地反映复习情况而不是平时学习情况，dz考前看错了考试时间，复习比较仓促，感觉至少要两到三天的时间集中突击才能得到比较好的分数。因此心导从内容上是一门实打实的超级好课，但是如果想要靠它刷分可能有些难度，因为期末复习的压力不小，平时也要注意作业完成的情况。总之，还是非常非常推荐心导这门课程的，毛利华老师的确非常有魅力！尽管在通识里面可能不是给分最好的，但选择通识课的主要目的不就是为了拓展自己的知识边界吗？"
  },
  {
    "id": 9,
    "courseId": "1233170",
    "courseName": "地震概论",
    "teacher": "赵克常",
    "semester": "25春",
    "publishDate": "2025-07-01",
    "overallScore": 4,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 4,
    "teaching": 4,
    "harvest": 3,
    "content": "【成绩构成】忘记有没有明确的占比了。平时分包括一次讨论报告或者pre，还有两次教学网上的作业，只要不要太拖拉，按时完成即可。考试应该是决定总评的决定性因素。 【课程感受】名副其实的北大第一大课。在这学期选课之前，dz曾看到很多测评洞说教员黑化了，要慎重选课。这学期上完，个人感觉确实不像往年所说的那样全部明示考试重点；但dz认为这反而是一件好事，因为这样可以最大程度上区分不去上课和认真上课记笔记的同学。只要每节课都认真听了并且记笔记，就算拿不了彩虹，混个90+应该还是可以的。 虽然教员不再明示所有的重点，但其还是有迹可循的，这里给大家分享几条dz觉得不错的区分重点的方法。首先就是重复次数，一遍过的绝对不考，重复两到三遍的就要考虑一下了。其次，每当教员开始强调“地震概论不是水课！”“不再跪呈彩虹，让你自己来拿！”一类的话时，前后讲的话有极大概率是重点，最好记下来。考点有时候会比较出人意料，比如这一学期教员曾在两次课上分别强调过为什么缅甸发生大地震并不代表着北京会发生大地震（然后后面都提了地概不是水课），给出的答案是不位于同一个地震带、无前兆还有事实胜于雄辩。dz在复习的时候一度以为绝对不考，但因地概背诵量不大，就顺带背下来了，结果真考了一个十分的大题。 这里还想提一嘴，虽然教员强调医学部的同学（非医预）不要选。但是地概不签到，只看回放就可以得到一个不错的成绩，很适合医学部的同学拉绩点。不过要注意，虽然不签到，但是临近期末的一节课要结组并上交讨论报告，别忘了交就行。 【考试相关】强烈不建议去树洞上找所谓之前学期得彩虹同学的考点整理，因为每年的考点几乎没有重叠。（但大电影考点重复比较多，可以收一份）。如果有时间给地概复习，建议去听回放，按照上面提到的找重点的方法去整理考点。若是再有时间就做做往年题，遇到不会的背下来就行了。dz这次考试中就出现了一道往年选择，倘若没提前看的话，dz大..."
  },
  {
    "id": 10,
    "courseId": "2039130",
    "courseName": "民俗研究",
    "teacher": "王娟",
    "semester": "25春",
    "publishDate": "2025-07-01",
    "overallScore": 3,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 2,
    "harvest": 4,
    "content": "分数构成是20%期中论文（其实更像期末论文，考试周才收纸质稿）+80%第16周的期末闭卷考，不考勤，整体蛮轻松的。能感觉到王娟老师挺热爱民俗这块的，但是前几节课听下来感觉有点PPT照着教材做、讲课对着PPT念的感觉，听起来实在有些昏昏欲睡，所以后半学期没去上过课（对不起老师） 论文主题是自选一个民俗有关的题材（比如神话、地方传统等），在一学期学过的民俗学说里选一个及以上，对你选择的题材进行分析和论述，下限2000上不封顶，dz当时好像写了8000+（？），可以自选是否要在最后交纸质版之前先邮件发给助教询问修改意见，不过可能dz比较擅长写论文再加上选的题材相对比较新颖小众，当时助教看过以后说很好不用再改了，不过个人感觉咨询助教修改以后可能心里会更有底一点。 最后的期末考试，老师会在最后两周提前发10道题的提纲，考试会在其中抽五道，选做四道，一题20分，500字左右。答题格式就是介绍一下问题里的学说的基本情况，然后结合文本进行分析，具体的规范老师会在考前提醒很多次，如果考前对自己的答案不确定的还可以去找老师问，虽然dz没去问，但根据树洞发言，对期末很有帮助。虽然不可避免地存在给分与预期不符的现象，但整体而言个人认为算是一个背到就有分的考试，dz在考前一个周末开始恶补课程内容并且结合ai润色了每道题的答案，在考试前背得很熟，最后得分确实符合自己的预期。老师课上说过不会超优秀率，但看统分洞似乎会把正态的同学的分调成84.9，也是很体谅学生了 dz最终得分:（95，100）"
  },
  {
    "id": 11,
    "courseId": "4334010",
    "courseName": "古代西亚北非神话与艺术",
    "teacher": "贾妍",
    "semester": "24秋",
    "publishDate": "2025-08-01",
    "overallScore": 5,
    "taskLoad": 1,
    "difficulty": 2,
    "grading": 4,
    "teaching": 4,
    "harvest": 4,
    "content": "这门课算是dz两年来在贵校选修过的最喜欢的通识课了！感觉脱离贵校这个环境确实很难了解到北非西亚这个小领域的文化，贾妍老师个人魅力也超级强，推荐！ 这门课主要讲述的是两河流域的神话，包括创世神话、洪水神话、吉尔伽美什史诗等经典文本，老师会从一些两河流域神话的经典意象和神的体系展开，说实话最开始两节课会感觉有点晕晕的，但是慢慢了解了整个神话体系以后，就会感觉各个大神之间的关系很有意思，有一些神的形象真的很丰满、很吸引人。课程后半段会穿插一些埃及神话，相对两河流域的体系性没有那么强，但会重点讲述一些有特色的主题，比如埃及猫等等。 我们那一学期课程任务量约等于零，没有任何平时作业，人少的时候老师会在群里随机发签到链接，算是平时分唯一的考察方式。期末任务是写一篇文章，之所以是文章不是论文，是因为老师对主题、形式都没有作任何限制，只要和课程内容有关系即可，老师在课上还明确表示过自己之前收到过同人文，觉得很有意思还给了高分。dz当时因为期末确实太忙，且感觉如果写专业性比较强的论文的话因为和老师专业对口反而容易暴雷，所以最后写了一篇五千字左右的神话扩写，最后也拿了很不错的分数。感觉老师（或者助教）不希望大家去卷字数、卷专业性，反而更喜欢她看了觉得耳目一新的文章。不过老师去年在课上开玩笑说感觉自己这门课的任务量有点太小了，考虑下一次开要稍微多一点点任务量，所以这部分仅供参考hhh 如果说这门课唯一有什么缺点，那就是老师讲课的逻辑性不算特别强，但dz个人认为这本身就是人文社科的通识课的魅力所在，太贴近课文照本宣科也没意思） 最后这门课的给分其实也还是不错的，老师说自己不会轻易给95+的高分，但是看统分洞里总评90-95之间的比例相当高，还是很善良的🥹 dz得分:（90，95）"
  },
  {
    "id": 12,
    "courseId": "1233571",
    "courseName": "太阳系中的科学",
    "teacher": "周煦之",
    "semester": "25春",
    "publishDate": "2025-06-01",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 5,
    "harvest": 4,
    "content": "#课程内容：课如其名，围绕太阳和系内行星讲授，大部分是科普性质的内容，也有少部分（潮汐作用、引力弹弓）等需要一些物理思维，但除了高中物理的向心力和万有引力之外没有考察其他的公式，总体来看对文科生相对友好。 #任务量：约70%的课上有考勤小测，没来一次总评扣5分（？）但老师很善良，合理的请假可以直接在群里说。平时有2-3次书面作业，题量就两三题，可以很快完成。 #老师：周老师上课听感很好，作为一个对空间科学很感兴趣的理科生，觉得老师在讲科普知识之外一直试图渗透出科学探索的情怀和理想，比如老师讲到土星的时候会放卡西尼号坠入土星的片子，讲到旅行者号的时候会提到卡尔萨根的暗淡蓝点，以及还有很多很多戳我的点。 #考核：考勤10作业20期末考70，考试允许不限量cheatsheet，dz前半学期有认真听讲做笔记，后半学期大部分在摸鱼，没有像大部分同学一样补回放而是只过了一遍PPT，最后带着cs考试觉得题目都相对简单，基本都涵盖在上课内容里。 #总评：90-95"
  },
  {
    "id": 13,
    "courseId": "23200001",
    "courseName": "材料与时代",
    "teacher": "曹安源",
    "semester": "24秋",
    "publishDate": "2025-08-01",
    "overallScore": 3,
    "taskLoad": 3,
    "difficulty": 2,
    "grading": 4,
    "teaching": 4,
    "harvest": 3,
    "content": "分数组成：70%（期中或者期末）+30%平时 课程感受：老师很有意思，会上课变魔术，会请十佳歌手表演，会叫人朗诵他的ppt，互动感还是不错的。知识性的内容可能不是很多吧），有肯定是有的，但是往往ppt上的内容是讲不完的，教室里的同学是不抬头听的，emm。dz确实没认真听过（忏悔过了）。 给分：90。dz还算比较活跃，每节课都去，每次坐的位置也比较靠前，发言次数也不少，但是老师不知道我的名字哇哈哈哈。我们这个学期是期中辩论赛，期末视频或者展板任选其一，dz社恐就选择了期末做展板，还是比较简单的，花了一天时间就做好了。据说参加辩论的同学给分都比较好，适合e人饱饱。看统分洞会有吹风机。"
  },
  {
    "id": 14,
    "courseId": "1635020",
    "courseName": "生活中的心理学",
    "teacher": "方新",
    "semester": "",
    "publishDate": "2025-06-01",
    "overallScore": 3,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 3,
    "teaching": 3,
    "harvest": 3,
    "content": "很大的课……前四节课是fx老师讲德式心理分析，后面的课就是每节课一个主题，比如说恋爱、学习、调节什么的。每节课是一个小时pre➕一个小时老师的讲解。在第一节课每个同学需要选好自己pre的小组，这个课有十个助教，每个助教会负责一组同学。 看了上学期统分洞似乎这课给分非常吹风机🧐dz自己算是拿了🕳️里相对较高的总评的，这里有一点小建议留给想要选课的🕳️u们：因为是助教给分加上每个人期中期末作业的差距应该不是很大，所以应该助教给分的主要标准是你在pre里的参与度。需要通过当组长或者和助教频繁沟通什么的在助教那里刷脸😂不过没当上组长也没关系，最后一节课会有每个组的分享环节，代表小组去分享参与度也挺高的，亲测有效👍🏻 成绩与考核：两次点名10%定位签到；期中作业依据前四节课的德式行为分析方法自我剖析30%；期末作业两篇和课堂展示主题相关的课程感受30%；20人左右的大组pre30%；"
  },
  {
    "id": 15,
    "courseId": "4031890",
    "courseName": "李大钊思想研究",
    "teacher": "王久高",
    "semester": "",
    "publishDate": "2025-06-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 5,
    "teaching": 3,
    "harvest": 4,
    "content": "算小拼盘课（❓）平均每个老师讲1-3节，围绕着李大钊的多个维度来讲，还有一节电影课。总体来说内容都不深，角度多，算是很成功的通识课，并且通过写论文的过程也确实学习了解了很多李大钊思想相关的东西。 评分标准：（参考统分🕳️ 7468181 🤣从给分上这课是绝世好课了） 60%期末论文选题和李大钊相关即可，下限2500上限10000；dz写了个中间值 4%两次签到； 12%去北大红楼或者李大钊烈士陵园等相关地方实践一次并且交500字实践感； 12%期末pre或者针对pre提问；最后一节课会有6组同学pre，没报名pre或者报名晚了没选上的同学（对dz就是准备了pre但是忘了提前报名的倒霉蛋😭）可以把ppt和讲稿都给助教（据说不影响给分）或者参与教学网的讨论或者线下提问 12%与ds的ai互动学习"
  },
  {
    "id": 16,
    "courseId": "4332710",
    "courseName": "西方美术史",
    "teacher": "丁宁",
    "semester": "",
    "publishDate": "2025-06-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 2,
    "teaching": 5,
    "harvest": 4,
    "content": "相对于选课更推荐旁听的一门课，最开始的时候旁听的人也确实很多，教室后边地上都坐了人hhhhh上课的时候老师会把所有的灯都关上，ppt上基本是整页的画很有沉浸感，老师声音很好听所以上课体验蛮好（不是）课程内容主要是对各个时期重点艺术家的重点作品的分析，作品包括但不限于绘画，雕塑，建筑等，同时掺杂着老师个人的上学or看展经历，整体内容其实比较的杂而散，并且ppt不发且上边也没什么东西，教考略为分离，但是还是能学到些东西的（蛮好玩的）。考核方式是期中论文加期末闭卷考试，期中论文选题不限，只要是西方美术史范畴就可以，并且ddl特别晚，dz秋季学期选的时候是十二月的ddl，每学期会选十几个论文写得特别好的期末免考，总评在九十以上；期末考试是七道还是八道大题选四道还是五道，有点记不清了，最后一道题是讲自己看展经历啥的实际题，反正是有容错的，考前会说哪个地方必考哪个地方是重点，考的基本都是比较正常热门的历史阶段。没有考勤。给分似乎相对一般？但dz期末背的不是很好全靠口胡，最后拿到了正态，感觉也还不错。 总评：84"
  },
  {
    "id": 17,
    "courseId": "1630079",
    "courseName": "心理学导论",
    "teacher": "毛利华",
    "semester": "25春",
    "publishDate": "2025-06-01",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 2,
    "teaching": 5,
    "harvest": 5,
    "content": "【教材】《心理学与生活》 第19版/第20版 两个版本区别不大 【考核方式】出勤10%+参与实验5%+平时作业35%+期末闭卷考试50% 出勤分数白送，mlh老师向来不点名 参与实验是需要一个小时的被试证明，不拿被试费。建议早点完成，拖到快ddl的时候就找不到实验可以参与了 平时作业是写两篇小论文（或者可以拍视频），主要是展现自己的看法，没有专业要求。比如第一次作业是让大家谈谈自己对心理学的看法。（巧妙地使用“比如”掩盖了其实不说第二次作业是什么是因为我忘记了毕竟我自己又不用写x） 期末考试难度不大，复习的时候要懂得抓重点，比如从众实验、认知失调，据说每次心导考试都会考（每次社心考试也都会考x）。背诵量嘛对于见识过普心的心院人来说是很简单的但是对第一次见识心院课程的外院系同学来说可能是会被概念表吓到的，建议结合往年题抓重点理解性记忆，有些概念显然不会考。 【给分情况】暂时未知，但是建议不要对心院课程的给分情况抱有太大期望。 【课程听感】极其精彩的心理学入门课程！！！毛老师的课程会很跳脱于课本，用自己的逻辑串联起他课上的知识，展现心理学一个个领域里的经典理论和经典实验。上课偶尔会有简单的互动小实验，比如内隐联想测验。心理学是很纯正的理科，但是作为导论课的心导（也包括普心）还是更像一门人文社科，不会出现上课听不懂的情况。 上课跳脱难免就会出现教考分离，课本上的不少概念上课完全不会提及，而且只是上课听得开心也很容易最后啥都没记住。而且没有心理学基础可能不太听得出来哪些知识是重要的。不过心导课更为重要的作用还是作为导论课展现心理学的魅力，破除一些大众对心理学旧有的刻板印象，激发对心理学的兴趣。mlh老师显然做到了使课程完美完成这一目标。"
  },
  {
    "id": 18,
    "courseId": "2432161",
    "courseName": "社会科学定量方法",
    "teacher": "罗杭",
    "semester": "25春",
    "publishDate": "2025-06-01",
    "overallScore": 1,
    "taskLoad": 5,
    "difficulty": 4,
    "grading": 2,
    "teaching": 1,
    "harvest": 1,
    "content": "【教材】《定量分析方法》，老师会很早在教学网上传电子书 一本课后题答案极其不靠谱的教材（很简单的题目也会有错误），据说lh老师的课的推荐教材都有这个问题 【教学内容】教材第九章《决策分析方法》，第十章《群体决策方法》基本所有内容；第八章《系统分析方法》部分内容；极少数教材上没有的内容，如PERT图（完全没有复习到位，结果期末考了一整个大题） 课程大纲是诈骗，上课内容远少于大纲上列出的内容。 上课ppt为纯英文，并不提前提供，在16周时统一提供。 “以前我都不给的，后面学生说要复习我才给的。” 【考试内容】“我们不考死记硬背的题目。”但dz感觉“死记硬背”并不是一个定义清晰的概念。比如“群体决策和个体决策相比的优点和缺点”这样可以非常有条理地完整分析的题目（群体极化、从众效应……）在老师和助教眼里大概是属于死记硬背范畴的。如此，上课的绝大多数内容都是并不重要的“死记硬背”的内容，比如决策的定义、类型；各种分析方法的好处，意义等等，于是可以作为考试内容的重点屈指可数。 结合两份往年题，考试重点主要是投票理论，风险型/不确定型决策，计划评审技术（PERT），条件概率等需要需要一定的计算或者画图的，上课有用多页ppt介绍并在黑板上写板书的，同时答案确定的内容。 【考核方式】签到20%+课堂展示40%+期末考试40% 签到本学期大概四五次，均为签退。 【课程听感】极差无比。 本门课程大部分的内容简单到小学生初中生都能学习，但是上课节奏异常拖沓，又因为ppt是纯英文并且平时并不提供导致学生信息接收速度大幅度下降导致这一点表面上看并不明显。但实际上假如ppt翻译一下就能轻松看出课程内容之水。按照北大一般课程的授课速度，这门课一学期的课程其实只需两三周就能上完。老师对于ppt是纯英文的解释是“课程有留学生”什么什么的，dz觉得是很扯淡的。看了教材后发现ppt不少内容就是教材内容的翻译，然而..."
  },
  {
    "id": 19,
    "courseId": "430171",
    "courseName": "人类生存发展与核科学",
    "teacher": "郭秋菊",
    "semester": "25春",
    "publishDate": "2025-06-01",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 2,
    "grading": 5,
    "teaching": 3,
    "harvest": 3,
    "content": "听感上dz由于物理基础很差上课很喜欢摸鱼所以基本没怎么听红豆泥私密马赛，课程内容主要包括一些基本的核反应过程、各种核技术的运用和各种核辐射防护之类的，内容都非常简单容易理解，dz是文科生感觉也没什么太大理解难度。开学的时候会组织买影印版的课本，可以购入或者收一本二手的。 任务量上应该是三次签到性质的课堂小测+一篇一千字以上的核科学主题相关的论文/上课做pre+期末开卷考试，老师上课偶尔会点名提问，但都是签到性质的答不上来也没关系的，老师人非常好。论文只要写任何和核科学有关的内容都可以，dz是结合上学期国政概小班课pre准备的内容写了一个核电出海的相关主题🤔期末考试是开卷，注意考前一周熟悉一下知识框架内容和往年题就好（dz的带答案版往年题也上传在了PKUHUB - 笔记与资料共享，仍然欢迎大家光顾，当然dz手里现在也有一套考试的纸质开卷资料随缘出，如果明年有选上的uu欢迎光顾） 结论：内容有趣任务量小可以刷分上课不用太听但对出勤率有要求并且挺难选的（但据说补退选能蹲到），缺IV类通选和想要刷分的同学可冲！ Dz得分【95，100】"
  },
  {
    "id": 20,
    "courseId": "3230020",
    "courseName": "政治学原理",
    "teacher": "马啸",
    "semester": "",
    "publishDate": "2025-06-01",
    "overallScore": 5,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 4,
    "teaching": 5,
    "harvest": 5,
    "content": "【成绩】90+ 【分数构成】读书报告20+观察报告10+pre展示20+期末考试50（考勤实行扣分制） 【课堂感受】伟大无需多言，mx老师yyds😭上课的内容涉及个人、集体、社会、国家、国际等多个话题，会讲述一些基础性的理论和现实案例，关注时政和热点问题，去年美国大选还让大家预测总统人选，并且抽了几个预测对的同学送了书籍hhh。mx老师上课深入浅出，对理论的讲解很到位，理解起来还是比较轻松的，算是dz为数不多听得比较认真的课了，很适合作为政治学的入门课程，课程一般在三四周的分组后会有pre环节，放在第三节课，很有效地缓解了三节大课的疲惫感，pre的话dz一般不咋听，考试应该也不会出关于同学pre内容的题目。此外，这个课是个大课，同学们讨论的热情还是蛮高的，树洞上随时可能有讨论🕳️，也很精彩 【考核情况】 ①观察报告和读书报告这一块mx老师都会给出均分等数据，方便同学了解自己的情况（插播一句sfl的同学们均分真的好高😂），dz是论文苦手并且刚上大学对论文格式啥的一概不知so读书报告得了比较差的分数（具体多少忘记了但是低于平均分），观察报告得分中规中矩 ②pre的话由组内互评、其他同学打分和mx老师给分共同组成，mx老师观察到大家给其他组的打分会随着课程进展而逐渐降低，所以会在老师给分这一块相应提高，很大程度上确保了各组得分的公平，各个小组的汇报也都很精彩，dz所在的组因为组内有同学全场没有参与小组分工所以我们瓜分了ta的组内分数，这一部分dz得分较高。 ③考试这一块，mx老师会给出往年题和答案，模式每年大同小异，个人觉得背诵理解ppt内容+熟悉往年题完全可以拿下这一部分，不过值得一提的是去年的选择题坑蛮多，要求同学们对ppt和上课内容的细节比较清楚，印象中dz错了三道选择题（痛，太痛了） ④考勤方面，抽取三次pre的评分问卷作为签到依据，去年dz发现问卷的一个时间限制小..."
  },
  {
    "id": 21,
    "courseId": "3230900",
    "courseName": "政治学原理",
    "teacher": "马啸",
    "semester": "",
    "publishDate": "2025-06-01",
    "overallScore": 5,
    "taskLoad": 4,
    "difficulty": 4,
    "grading": 4,
    "teaching": 5,
    "harvest": 5,
    "content": "【成绩】90+ 【分数构成】读书报告20+观察报告10+pre展示20+期末考试50（考勤实行扣分制） 【课堂感受】伟大无需多言，mx老师yyds😭上课的内容涉及个人、集体、社会、国家、国际等多个话题，会讲述一些基础性的理论和现实案例，关注时政和热点问题，去年美国大选还让大家预测总统人选，并且抽了几个预测对的同学送了书籍hhh。mx老师上课深入浅出，对理论的讲解很到位，理解起来还是比较轻松的，算是dz为数不多听得比较认真的课了，很适合作为政治学的入门课程，课程一般在三四周的分组后会有pre环节，放在第三节课，很有效地缓解了三节大课的疲惫感，pre的话dz一般不咋听，考试应该也不会出关于同学pre内容的题目。此外，这个课是个大课，同学们讨论的热情还是蛮高的，树洞上随时可能有讨论🕳️，也很精彩 【考核情况】 ①观察报告和读书报告这一块mx老师都会给出均分等数据，方便同学了解自己的情况（插播一句sfl的同学们均分真的好高😂），dz是论文苦手并且刚上大学对论文格式啥的一概不知so读书报告得了比较差的分数（具体多少忘记了但是低于平均分），观察报告得分中规中矩 ②pre的话由组内互评、其他同学打分和mx老师给分共同组成，mx老师观察到大家给其他组的打分会随着课程进展而逐渐降低，所以会在老师给分这一块相应提高，很大程度上确保了各组得分的公平，各个小组的汇报也都很精彩，dz所在的组因为组内有同学全场没有参与小组分工所以我们瓜分了ta的组内分数，这一部分dz得分较高。 ③考试这一块，mx老师会给出往年题和答案，模式每年大同小异，个人觉得背诵理解ppt内容+熟悉往年题完全可以拿下这一部分，不过值得一提的是去年的选择题坑蛮多，要求同学们对ppt和上课内容的细节比较清楚，印象中dz错了三道选择题（痛，太痛了） ④考勤方面，抽取三次pre的评分问卷作为签到依据，去年dz发现问卷的一个时间限制小..."
  },
  {
    "id": 22,
    "courseId": "1536830",
    "courseName": "生态学与环境变化",
    "teacher": "方精云",
    "semester": "",
    "publishDate": "2025-10-01",
    "overallScore": 5,
    "taskLoad": 1,
    "difficulty": 2,
    "grading": 0,
    "teaching": 5,
    "harvest": 1,
    "content": "【成绩】90+ 【分数构成】考勤20+期末开卷考试80 【课堂感受】选这门课主要是dz高中时期对生物比较感兴趣，而方精云老师就出现在生物书的科学家访谈部分，想着见见真人hhh，虽然最后课没咋听。这门课是四个老师合上的拼盘课，每个人负责一部分，其中王志恒老师的ppt会有比较多的英文部分但是也没有什么障碍，总体上来说四个老师的讲授内容都挺入门挺有条理的，对有生物地理基础的同学来说真的很友好，推荐。 【考核情况】 ①考勤：四五次可以使用手机电脑ppt等参考的签到性质小测，如果该次课程有考勤课前投屏的ppt上就会有相关题目，可以基于此判断本堂课是否考勤，有几位老师还会很友好地跟在场的同学说提醒没来的同学过来上课，基本上就是一个可以预判或者说可以及时补救的考勤 ②期末考试在总评中的占比极大，但是是开卷，打印好ppt即可，可以的话还是打印得清晰点，并在各个部分折页进行标记，方便翻阅。25春之前树洞上几乎没有往年题，但是25春考完试之后，dz和几位洞u合力回忆了25春的考试题目，供各位参考，dz的感觉就是ppt上都可以找到答案，答题对着抄就行，知识性的选择题也是找到ppt来源和依据即可，但是选择题有一些需要思考和推理，不过dz靠着高中残存的生物地理知识基本都能直接选。"
  },
  {
    "id": 23,
    "courseId": "1630740",
    "courseName": "爱的心理学",
    "teacher": "李同归",
    "semester": "24春",
    "publishDate": "2024-06-01",
    "overallScore": 3,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 4,
    "teaching": 0,
    "harvest": 1,
    "content": "【课程内容】进化心理学、依恋、爱情理论等。 【考核】每次课上都有的问卷（签到）+小组作业+个人期中作业+期末考试。任意一项为零分及挂科。 【得分】92。说实话，这门课挺水的，每次上课dz都是在划水。论文也是在半天之内写好的。如果只是想水学分还是比较建议。但是想学心理学知识的话多少有点水水的。"
  },
  {
    "id": 24,
    "courseId": "1339320",
    "courseName": "中国历史地理",
    "teacher": "韩茂莉",
    "semester": "24春",
    "publishDate": "2025-02-01",
    "overallScore": 5,
    "taskLoad": 2,
    "difficulty": 0,
    "grading": 2,
    "teaching": 5,
    "harvest": 5,
    "content": "老牌通识课，头衔很多。四类通识核心课，思政选择性必修课。 韩奶奶上课水平当然是毋庸置疑的，她是历史地理领域的专家，上课可以说是信手拈来，内容对于感兴趣的同学会相当有意思，不会点名但上座率极高。不过韩老师马上要退休了，上这门课的机会可以说是越来越少了（毕竟韩奶奶的文化地理学已经停开了😭） 关于考试，期末闭卷占比100%，背吧。上课时能对照往年笔记补充一些新内容最好，因为新补充的内容很可能会考hh。城环优秀率卡得很死，一点不背韩奶奶也不会手下留情的，属于是付出和回报成正比的课。 至于往年题，相信大家能用树洞搜课程测评，也一定能搜到每年的考题回忆doge。 ps:韩奶奶主编的《中国历史地理十五讲》也很有意思，dz当了一个学期睡前读物x dz得分90-95"
  },
  {
    "id": 25,
    "courseId": "1233170",
    "courseName": "地震概论",
    "teacher": "赵克常",
    "semester": "24春",
    "publishDate": "2024-06-01",
    "overallScore": 5,
    "taskLoad": 2,
    "difficulty": 3,
    "grading": 0,
    "teaching": 4,
    "harvest": 4,
    "content": "简单一句，北大第一大课，但绝对不是第一水课。 【成绩构成】：80%考试，10%讨论，10%两次作业（听说这次没交作业不扣分，讨论报告交了就行） 【课堂评价】：教员人很好，讲东西有条理，课堂内容不多，和他说的一样前紧后松，每节课讲会突出重点，炒股也会讲一些但是很少。dz不太喜欢的是，教员总是反复提被举报的事情（orz有点像祥林嫂），教员的心情可以理解，对我来说无伤大雅，但总扯到这些会影响整体观感。有些人可能不喜欢教员的说话风格，在dz这里感觉可以理解，教员是刀子嘴豆腐心，很朴素的话说的也现实，但终归教员人很好，北大第一大课是值得的。 【考试作业】：每学期有两个班，课上强调重点不同，考试重点也会相应变化。地震概论真的不水，关于地震波的理论那块挺难的只是不考而已。要考高分每节课的重点总得知道，已经很明确了，所以即使有不去的时候也应该补回放，信某些🕳️的笔记没用。考试题分为选择、判断（均为一题两分）、填空（3分）、简答（一题好像是4分左右）、论述（8分）和两道计算。计算题是确定的，很简单练会就好，其他的都在课上讲的重点里和作业题里（往年题作用不大）。 两次教学网上的作业，10道选择，可多次做，期末考试可能会抽几道。 That’s all."
  },
  {
    "id": 26,
    "courseId": "2939991",
    "courseName": "英美侵权法",
    "teacher": "徐爱国",
    "semester": "24春",
    "publishDate": "2024-07-01",
    "overallScore": 5,
    "taskLoad": 1,
    "difficulty": 3,
    "grading": 5,
    "teaching": 3,
    "harvest": 4,
    "content": "【成绩构成】两次小测20%，论文80% 【课堂内容】围绕英美侵权法的不同侵权类型等展开，会有很多案例分析。老师讲案例会很有意思，但是最后听完发现有点无体系（其实作为通选课听一听是蛮有意思的），助教和老师人很好，下课后也经常有同学提问问题。前期觉得老师说话方式蛮有意思，但后期觉得那样太让人瞌睡了哈哈哈哈哈 【任务量】超小。小测两次是不定时的，上课前的下午才会在群里通知。一次给定的法律案例分析，一次自己写一个奇葩法律案例（说清楚为什么奇葩），dz觉得自己写的就是一坨💩，但最后给分来看，只要不是写了什么大逆不道的，小测应该不会扣很多。老师对论文要求比较高，三部分组成（法律事实+法律分析+法律评论），最后要结合自己的专业从不同角度分析，但老师给分超级好（最后写的时候感觉像是翻译法律案例？）案例必须是英美国家的，可以用lexis数据库，dz得分不是很高但很满足了，是既可以刷分也可以对侵权法有不少了解的好课。 最后还是要夸夸超nice的老师和助教学长！！！"
  },
  {
    "id": 27,
    "courseId": "2039130",
    "courseName": "民俗研究",
    "teacher": "王娟",
    "semester": "24春",
    "publishDate": "2024-06-01",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 0,
    "grading": 2,
    "teaching": 5,
    "harvest": 5,
    "content": "【课程内容】王老师民俗研究课程的内容可能和大家理解的民俗不太一样，是用一些神话理论对经典神话故事进行分析，个人感觉能学到很多神话学的理论知识，提高神话分析能力，课程也十分有趣，老师也十分温和负责。美中不足的是下午5-6节，而且老师一贯没有课间休息。上下来可能会很累很困，建议本身对神话学、社会学很感兴趣的同学选课。 【考核标准】20%小论文(2000字）+80%期末闭卷考试 个人觉得考核方式非常人性化，小论文字数要求不高，而且可以提交初稿，助教会提出改进意见，最后的论文ddl在期末，任务量很小。而期末虽然是闭卷，但老师会在最后两节课给出考试范围（10道题思考题中抽5道组成期末考试试题 最后五道里选做四道），并且最后一节课老师也会答疑和给出提示。不过最后备考背诵量还是偏大的，而且要特别注意老师给出的答题模板。 【个人建议】dz个人很喜欢这个课程，能够从全新的角度去认识自己熟悉的神话。dz整理期末思考题时是主要是依据赛艇上的往年答案稍作修改，没有现成答案的就用自己对理论的理解稍加分析，结合了神话学家的著作和万能gpt，梳理出一份自己满意的答案后开始背诵，大概总共的背诵时间是8h-9h（拆分到两个下午 两个晚上和一个上午），最后期末考试的时候也写得满满当当。dz本人得分不错，不过看到统分洞的情况不少人表示给分疑似吹风机，有很多同学说很用心地学了却拿到一个偏低的分数，所以建议大家结合自己的实际情况慎选，如果选的话平时稍微听一下课程中神话分析的有趣部分，熟悉各项理论，最后背起来会轻松很多。 【得分】90+"
  },
  {
    "id": 28,
    "courseId": "2930187",
    "courseName": "中国当代法律和社会",
    "teacher": "彭錞",
    "semester": "23秋",
    "publishDate": "2024-01-01",
    "overallScore": 5,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 3,
    "teaching": 5,
    "harvest": 5,
    "content": "【课程任务】三次3000字内的课程作业（25%+35%+40%），总体任务量偏小。（太喜欢没有期末考试的课程了！）唯一美中不足的是作业内容主要就是对给定的司法案例进行分析，肯定与否定的持方由老师随机给定，dz两次抽到巨难写的持方，还是有一点运气成分在的。 【课堂氛围】课堂氛围很好！老师上课很有梗，案例选取也贴合实际且引人深思，概念讲解深入浅出，基本上课堂提问都能听到同学们各种不同的看法的。 【个人感受】本学期学得最开心的一门通识课，对中国法律历史、现行中国法律体系、基本法律概念、法律与社会生活的关系等方面都有所涉及，适合对法学感兴趣的同学。课堂多思维磨炼，老师会比较注重引导思考的提问而不是直接给出答案，很适合我这样的infj小老头去思考人生。 【给分状况】往年给分很好，今年似乎有一点压分倾向，高分同学少，85-90分同学多，总体给分不错。"
  },
  {
    "id": 29,
    "courseId": "2332323",
    "courseName": "坛经",
    "teacher": "周学农",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 2,
    "difficulty": 0,
    "grading": 4,
    "teaching": 2,
    "harvest": 5,
    "content": "【课程体验】周老师的上课风格比较灵动，意思是会说一些“故弄玄\n虚”的话，提出问题来引发你的思考，如果对禅宗比较感兴趣，可以\n产生不少有趣的思考点。老师不会按照坛经的顺序讲解，而是会按照\n授课的逻辑选不同的片段来品读，建议是要每周上课前读完要求的一\n段经文，会有助于上课的效果。不过周老师还是多少有点催眠，上学\n期是周二下午 5-6 的课，dz 经常睡着（笑，dz 确实比较感兴趣，在\n老师的启发下读了维摩诘经和法华经，感觉很有收获。\n【任务量】任务量不算大，平时有三篇提纲的内容，但是比较基础，\n每个人要负责写一次课前讨论提纲、课后讨论报告，和对其他小组讨\n论提纲的总结报告。讨论提纲占 15%，讨论报告 10%，总结报告 10%，\n课堂发言 5%，期末论文 60%。\n【给分】论文给分比较友好，符合通选课的定位，dz90+。\n【选课】不知道为啥选课很火，去年 100/50，好在 dz 可以把它设成\n推荐，顺利选上。不过这门课似乎开课第一周有一个退课小高潮（笑，\n想选课的同学可以蹲。"
  },
  {
    "id": 30,
    "courseId": "1831990",
    "courseName": "跨文化交流学",
    "teacher": "关世杰",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 1,
    "taskLoad": 3,
    "difficulty": 0,
    "grading": 2,
    "teaching": 1,
    "harvest": 1,
    "content": "【课程听感】有些无聊。关老师是 ppt reader，基本上就是照着 ppt的内容念，而且 ppt 的内容都在老师发的书稿里，所以 dz 都没怎么听过。\n【任务量】个人感觉不小。因为关老师马上要更新这门课的教材，所以每周会在群里发书稿供大家阅读批注，整个学期需要写够 500 字的批注。还有一次 2500 字读书报告、一次小组 pre 和 5000 字以上的期末论文。老师还要求小组一个学期进行至少五次讨论，然而 dz 所在的小组成员都很佛，所以我们一次也没讨论过…最后 pre 用的是一个小组成员的论文初稿做的，组长汇报的内容基本上都是编的…\n【给分】P。据说关老师给分中规中矩，绝大部分都在 80-90 之间，比较好的能拿到 90 出头的分数，再往上就是凤毛麟角了。如果想刷分不太推荐。"
  },
  {
    "id": 31,
    "courseId": "2132990",
    "courseName": "中共党史专题",
    "teacher": "黄道炫",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 1,
    "difficulty": 0,
    "grading": 3,
    "teaching": 5,
    "harvest": 4,
    "content": "黄老师水平不用多说，讲课也很有风采，但是会比较随性发挥而不是按照既定的 PPT 或者课本来讲，做笔记可能会累一点。当然这门课完全不考勤，如果你想水过去也不是不可以……任务量：可以自愿报做 pre，此外只有一篇论文或读书报告，据说老师比较喜欢同学写他自己著作的读书报告。给分比较平，优秀率大概会给满但是 90+很少，基本没有 80-，是个稳妥的选择。我没做 pre，写的是老师某部大作的读书报告，有幸被老师夸奖，最后得分 90-95."
  },
  {
    "id": 32,
    "courseId": "3034040",
    "courseName": "数据科学导引 C",
    "teacher": "黄文彬",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 5,
    "taskLoad": 3,
    "difficulty": 4,
    "grading": 0,
    "teaching": 5,
    "harvest": 5,
    "content": "绝世好课我只能说，一共三个老师分别对应着三个不同的部分 第一部分dz基本没怎么听过（挺水的 好像在讲什么数据的作用之类有的没的）二三部分讲的是一些统计方法和画图代码实现以及最后的机器学习部分 比较适合\n文科院系的同学来选但是作为一门通选课 如果真要抱着学到知识的角度来说 可能还是需要课下多下点功夫 当然水一水也完全没问题上课老师会讲一些基本方法和案例分析 课后一共有两次作业（也有可能是 3 次）老师不排斥用 gpt 写 所以理论上这些作业完成倒也还好然后还有一次大作业（小组作业）（由于没有期末考试 这个肯定占比最大 大作业要求对一个做好的案例进行分析 讲一讲案例的过程并提出改进方案之类 在完成小组报告的基础上会进行课堂展示所以总的来说这门课属于想学的话能学到很多 摸鱼的话也可以 只要把最后的大作业搞的漂亮一点就好了"
  },
  {
    "id": 33,
    "courseId": "2132864",
    "courseName": "《史记》解读",
    "teacher": "李霖",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 4,
    "harvest": 4,
    "content": "【任务量】老师在开学时会发讲课大纲，平时的任务主要是预习下节课讲的内容，并回答大纲上的问题，老师会在下一节课随机抽几个人回答大纲中的问题。如果想完全预习完下节课的内容花的时间不少，但如果只是为了回答问题的话，每周一个小时足够了。主题讨论（只在期中进行一次）是老师布置几个主题，分成几个讨论班，由同学展开讨论（不是小组任务），dz 选的主题是商鞅变法究竟是成功的还是失败的，主题讨论所需要花的时间也并不多，对每个篇章内容有基本了解的话几个小时就可以准备的非常充分。期中读书报告是结合汉代之前的几个篇章，探讨史事或者太史公旨趣，1000-1500 字。期末是结合汉代的篇章，2000-3500 字。\n【课程体验】dz 的课程体验还算不错，课程内容并不要求有历史方面的积累，因为课程主要是想通过《史记》来分析太史公的想法，而不是我们的想法，虽然有点空中楼阁但是蛮有意思的，老师的想法有时候也比较具有颠覆性，如果想从这门课学历史可能收获没那么多，但如果是想学习如何读文献，亦或者体验揣摩太史公心路历程的快乐的话，那这门课是很合适的。这门课也没有专门的签到，只有课前提问可能会暴露来没来。主题讨论大家也并没有太卷，在讨论过程中也可能会产生很多新的好的想法，因为老师或者助教会引导我们思考，有想法就说就完事了。给分感觉还行，dz 是大一纯理科生，准备也没有很充分，最后也优秀了"
  },
  {
    "id": 34,
    "courseId": "2432440",
    "courseName": "国际法与国际关系",
    "teacher": "赖华夏",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 5,
    "taskLoad": 3,
    "difficulty": 0,
    "grading": 3,
    "teaching": 5,
    "harvest": 5,
    "content": "华夏老师人美心善我已经说累了，这门课从国际政治的一些基本概念讲起，涵盖了国际法相关的各个方面，特别是由于老师目前的研究兴趣，最后几节课是结合实际案例来重点讲述国际贸易法和投资法。每节课开始之前，老师都会让大家分享上周看到的关于国际法的新闻，不过这学期大家似乎都很 i 所以有时候会冷场（下学期选这门课的同学请多多和老师互动）。成绩构成是课堂练习 10%、期中考试 30%、期末论文 50%、课堂参与 10%。dz 是因为之前就对国际法很感兴趣，所以论文好好准备了，但可能期中考试答得不是很好，所以最后得分不是很满意。看统分洞应该有很多其他院的同学得分都特别高，总之非常欢迎大家来选"
  },
  {
    "id": 35,
    "courseId": "6232000",
    "courseName": "经济学原理",
    "teacher": "张维迎",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 4,
    "teaching": 4,
    "harvest": 4,
    "content": "【课程听感】汪老师的 PPT 基本上是提纲形式，没有很多设计，但是很清晰，也附有例子和例题，对于课下自学选手还是很友好的。基本是跟着曼昆那本经济学原理讲的，当然老师会有自己的侧重点和授课节奏。老师是负责而为大家考虑的，有时还会很可爱；在第二次期中考试出分后（大家成绩都不太好看的时候（均分 68.5 分），在课上安慰大家说自己是按排名给分，告诉大家不用太在意卷面分并举例说明如果将总分在 137 分大概同学们都会满意自己的分数了（笑）。汪老师的讲课风格中规中矩，难说是有魅力的吧，但是讲的逻辑是清楚的，课下提问也会很耐心地回答，总体听感还是不错的。\n【作业/任务量】总共 11 次作业，总占比 5%。次数应该算比较多的，不过作业题确实帮我更好地理解了课上的内容，所以我并不认为增加了任务量。但是作业题难度往往小于考试难度，考试时有不小的落差感，更匹配大概会更好一些吧?没有其他任务。\n【关于考试】3 次考试，30%+30%+35%。第一次和第二次是微观内容，第三次是宏观内容。第一次均分 85 分；第二次均分 68.5 分；第三次均分 79 分。考试后（除了刚出分的期末）助教会发试卷原题和答案，每个人都可以去领答题卡。题目是出的很好的，订正完试卷感觉自己又学到了很多。但是选择题都是不定项选择，第二次和第三次考试的不定项选择数量又很多，所以试卷难度就直线上升。但是还是像前面所说，老师是按排名给分，且最后申请了超优秀率（我自己得到的分数就明显是调过的），所以不必太在意卷面分。只能说老师的给分也是守序善良的，既没有像其他“好课”那样给大多数人 90+甚至彩虹分以让所有人喝彩，也没有让付出努力较少的同学得到一个太难堪的分数。综上，是一门好课，中规中矩、守序善良的好课。"
  },
  {
    "id": 36,
    "courseId": "1630740",
    "courseName": "爱的心理学",
    "teacher": "李同归",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 5,
    "difficulty": 0,
    "grading": 5,
    "teaching": 3,
    "harvest": 0,
    "content": "【课程听感】缺点是任务量大+经常签到+课程内容不够有趣，优点是期末前模拟卷 70%和考试一致，所以考试很简单，且只要认真完成作业+从不翘课分数就会很好看。并不是直接“快跑”的课。\n【作业/任务量】大于 5 次签到+期中自传+期末小组论文+期末小组视频作业+期末考试，偏大。"
  },
  {
    "id": 37,
    "courseId": "137975",
    "courseName": "音乐与数学",
    "teacher": "王杰",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 3,
    "difficulty": 4,
    "grading": 3,
    "teaching": 4,
    "harvest": 0,
    "content": "【课程听感】不是门水课，起码对乐理小白来说是这样的。课程内容主要是乐理+基于乐理的数学理论，类似律学，调式音阶和弦，新黎曼理论之类的。数学部分的内容并不深入，主要涉及粗浅的群论知识，对零基础的同学来说应该也没有任何问题，但又恰到好处地向学生揭示了音乐理论的优美（特别是新黎曼理论的部分）。老师上课讲得不错，条理清晰，节奏适宜，而且会照顾到零基础的同学。但这个学期dz 去上课的次数不多，基本上是用 ppt 和课本自习。ppt 逻辑清晰可以充当完整的学习素材，完全不会有摸不着头脑的情况发生。\n【作业/任务量】；总共 4 次平时作业，每次作业涵盖 2-3 次课的内容，如果完整听下来的话应该不难，但需要花一定的时间精力。以dz 为例，由于没去上课，在做作业的时候还要从头自习对应内容，这样的话基本上需要 3 个小时的时间。对于乐理小白而言可能需要花更多的时间，因为需要数数识谱（痛苦面具）。会有一次大作业，包含6 个选题。这学期选题有：鼓的振动模态、我国古代律制问题、寻找记载毕达哥拉斯五度相生的最早文献、机器作曲-遗传算法、和声分析、旋律的变化与发展。包含各个学科门类，不必担心有不可做的情况出现。每组人数 4-6 人，自由组队（这么多人肯定会有划水的）。dz 的选题是机器作曲·遗传算法，相信对于 xk 平均水平的同学来说是非常简单的（别太卷的话），代码的部分基本上都由 dz 和另一位xk 的同学完成，本人绝对用时大约一天。总体来看的话大作业任务量不大，选题有趣，给分还行（应该），做的时候不会感到折磨。\n【关于考试】平时作业 10%+大作业 30%+期末闭卷 60%。期末考试内容基本与平时作业对接，题型是选择+填空，还有一道附加题用于调分（关于课程评价的）。可以多看看往年题，起码今年有很多题就在往年题里面。复习的话只要把 ppt 和平时作业过一遍就问题不大。记得练练看谱，期末题基本上都是根..."
  },
  {
    "id": 38,
    "courseId": "2034540",
    "courseName": "影片精读",
    "teacher": "戴锦华",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 5,
    "taskLoad": 3,
    "difficulty": 0,
    "grading": 3,
    "teaching": 5,
    "harvest": 5,
    "content": "【课程听感】很好\n【作业/任务量】还行，期中（随堂测验，根据老师当场给出的影片作感想）+期末（根据老师规定的电影作感想）+考勤。但是给分不行. 树洞（戴锦华老师）不知道该怎么评价这门课因为我觉得不需要评价中文系最受欢迎的通识课没有之一戴老师的水平无话可说对于每一部电影的解读都堪称洞见 或许存在与戴老师意见和立场不同的同学但是戴老师很欢迎讨论我印象最深刻的几部电影解析（不是电影本身，是戴老师的讲读）是《窃听风暴》《海上钢琴师》《布达佩斯大饭店》以及《她》（或译《云端情人》）基本上可以无脑冲考核是一次期中小测和一篇期末论文(3 以内）会有规定的片单 dz 当时写的是《小偷家族》期中写得\n一塌糊涂 最后总评上了 90 也是很满意不过想刷分的同学可能需要考虑清楚非人文社科或者在思想史文学史方面没有兴趣的同学选这门课爆炸的几率很高毕竟是好几百人的通识大课但总之内容绝对是贵校数一数二的极品课程在戴老师很快就要退休的状况下更是强烈推荐。"
  },
  {
    "id": 39,
    "courseId": "136700",
    "courseName": "普通统计学",
    "teacher": "艾明要",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 0,
    "teaching": 2,
    "harvest": 5,
    "content": "课程感受】其实在 gsm 大一已经上过一次概率统计了，也拿到了相对挺好的成绩，按理来说没必要再上一次普通统计学，但是疫情学期其实 gsm 概统的统计部分缺失了很多内容，也想借助一些先发优势提振 gpa，所以选择了普统。普统其实 21 秋的风评非常不好，据说存在大幅度向下调分情况，所以心情还是挺志忑的。但其实一学期结束之后，虽然老师有点小滑水(指 ppt reader)，但个人在这门课上还是觉得有所收获，第一个在于补齐了大一下概统留下的统计学知识漏洞，包括最基本的 ANOVA，第二个在于增强了自己的统计处理能力，让统计学知识落地，至少在这门课上接触到了 SPSS,R 等统计软件，也倒\n逼着自己学会了更多关于 Python 和 Latex 的用法，而不仅仅停留在数学推理层面。总而言之，这是一门体系健全，实践导向的通选课，且难度不算太高，对于没有接触过概统知识或者已经接触过概统知识的同学相信都能在这门课堂上有所收获。\n【考核】原来的考核方式是平时作业 10%+期未报告 30%+期未考试60%，但由于疫情原因改为了平时作业 30%+期未报告 70%，平时作业的话次数不多，但是做起来还是有点小费时间，因为是用 spss 跑回归，用 r 做随机模拟之类的，期未报告的话是给了一个数据集，难度不算大，但是能否做的足够细致是一个考验。当然，以后不太可能延续这样的考核方式，老师和助教也可能更换，这条测评可能对之后的同学不一定有太大参考价值"
  },
  {
    "id": 40,
    "courseId": "1230410",
    "courseName": "地球与人类文明",
    "teacher": "陈斌",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 4,
    "difficulty": 2,
    "grading": 4,
    "teaching": 2,
    "harvest": 2,
    "content": "课程体验】适宜不想动脑但喜欢干琐事并且希望刷分的同学，任务量较大，小组一个学期要做 4-5 个 pre，期末有 4000-5000 字论文，还有 2-3 个实验报告，但难度都不高。干货几乎没有，课程内容类似于青少年科普读物。趣味性足，会有师兄师姐带着做野外的实地考察，还会参观矿物博物馆，如同郊游，特别放松心情。给分最后与 pre 和平时的实验报告挂钩，但几乎只看量不看质，可水。\n【给分】dz 小组成员给分在 85-95 之间，可能无法高分，但几乎不会踩雷"
  },
  {
    "id": 41,
    "courseId": "1630079",
    "courseName": "心理学导论",
    "teacher": "毛利华",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 4,
    "teaching": 4,
    "harvest": 4,
    "content": "【课程听感】非常好的心理学通识课！有干货，每节课的结尾也会有抒情式的升华（因此也比较推荐新生选哈哈老登已经失去情怀了 x）总之很推荐旁听，选不选课看你想不想卷。\n【任务量】似乎是考勤+一次被试+三次平时作业+一次期末闭卷考试，期末考试占大头（50%还是多少来着有点忘了）。考前两周会给关键概念表，覆盖 80%的知识点，剩下的来自课堂或者《心理学与生活》。\n【给分】印象中是按照正太来的，不好好背书会有吃 85-的风险。dz作业写得很水但平时认真听课了+期末背了关键概念表，最终 90+。"
  },
  {
    "id": 42,
    "courseId": "1339180",
    "courseName": "世界文化地理",
    "teacher": "邓辉",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 2,
    "grading": 5,
    "teaching": 3,
    "harvest": 3,
    "content": "【课程听感】很好!内容覆盖面很广，介绍了基本地理概念、文化区，以及世界范围的城市、农业、工业、人口、语言、宗教、政治等文化要素，可以满足你对文化地理的期待。基本每周讲书上一章的内容，第 14 周看教学电影，第 15 周复习，第 16 周考试。内容比较基础，对高中没选地理的同学也很友好，\n【作业/任务量】轻松。作业不多，每周有个分章练习（每次练习 10道题，一共 11 个练习），内容就是教材上的基础知识，翻书就能找到答案。期中作业是个分析题，可以结合课本思路，给分也不错。\n【关于考试】平时分章练习 20%，期中作业 20%，期末考试 60%。期末考试开卷，包括简答题、分析题、综合题，不难，总体给分也好。"
  },
  {
    "id": 43,
    "courseId": "4834350",
    "courseName": "医学通识：信息时代的健康素养",
    "teacher": "陆俊林",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 2,
    "difficulty": 3,
    "grading": 5,
    "teaching": 3,
    "harvest": 3,
    "content": "【课程听感】非常有意思，老师很幽默，每堂课都有很多有趣的故事\n【作业/任务量】平时作业就是课最后五分钟小测，非常简单，正确率 60%就是平时分满分。\n【关于考试】期末有个大作业，我们是自由分组做指定主题的科普视频，虽然压在了其它考试的 ddl 上，但是给分 nice。"
  },
  {
    "id": 44,
    "courseId": "3930100",
    "courseName": "全球视野下的犹太文明",
    "teacher": "杨梦",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 2,
    "grading": 5,
    "teaching": 4,
    "harvest": 3,
    "content": "【课程听感】Ym 老师自然是 yyds，课程 PF，有 40 个名额自选百分制，但根本报不满，百分制大作业是论文和创意作业（就是很宽泛搞啥都行，但一般以 B 站互动视频为主）二选一，还有所有人都要做的一个问卷星，里面题量不算小大概 2000 字不到，但作为一整个学期唯一的任务量已经很好了。上课很有意思，也能收获很多知识，老师会记住积极互动的同学的名字。Dz 唯一的忠告就是 PF 的同学写问卷星的态度请务必端正，胡说八道或者大量抄袭会喜提老师群内指名点姓炮轰。Dz 课堂算积极里比较不积极的，两次额外加分活动参与了一次，最终得分 97-100。"
  },
  {
    "id": 45,
    "courseId": "2330003",
    "courseName": "哲学导论",
    "teacher": "李猛",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 5,
    "difficulty": 5,
    "grading": 3,
    "teaching": 3,
    "harvest": 4,
    "content": "【课程内容】讲柏拉图和笛卡尔，柏拉图会选两三篇经典文本，每年会换一下，笛卡尔应该一直讲的是第一哲学沉思。猛师讲课水平自不必多说，但体验感也取决于选讨论班运气如何，我所在的讨论班助教很 nice 很负责，每周辩经可以说趣味无穷…哲学写作比较痛苦，每两周被折磨一次，但对阅读写作的锻炼提高很大。\n【考核】两篇 2-3k 小作业，三篇 3-5k 论文，期末考试。建议是自己思考的同时，多参考赛艇往年资料，至少保证回答问题时大方向不出错。\n【得分】88-92。我还是蛮真心建议有学术志向的社系人选的，给分不会太差，但比 wzj 哲导能学到的东西多太多了"
  },
  {
    "id": 46,
    "courseId": "2131580",
    "courseName": "中美关系史",
    "teacher": "张静",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 5,
    "teaching": 3,
    "harvest": 3,
    "content": "课程听感】老师很用心，ppt 准备得很好，内容非常翔实。对于历史系同学来说也是有很多收获。对待学生也很热情，经常答疑。平时上座率在 50%-60%的样子，点名时候会坐满，感觉大多数同学是因为给分好而来的吧。老师实在是太宽仁了，给分还分成外院系和历史系，不知道优秀率分配上是不是会据此有所调整。而且还有助教专门讲作业怎么写的课，几乎是手把手教人怎么写读书报告/论文，还能有更贴心的课吗？\n【作业/任务量】若干次点名（群里有提醒）+期末论文（给的是 5000字上限，不鼓励卷）\n【关于考试】无\n【得分】91-95"
  },
  {
    "id": 47,
    "courseId": "1832760",
    "courseName": "英语新闻阅读",
    "teacher": "何姝",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 4,
    "difficulty": 4,
    "grading": 2,
    "teaching": 3,
    "harvest": 3,
    "content": "【得分】正态\n【统分洞】#5845858 显然给分让人很难评价\n【成绩】考勤 10%课堂表现 10%期中视频 30%期末开卷考试 50%\n【课堂】dz 都不知道怎么说了我当初干嘛选这个课呢太抽象了上课基本就是在读新闻讲个人经历总之学不到东西倒是可以当做自习课... 【考勤】有过两三次签到\n【pre】选择性参加 dz 没参加\n【作业】期中要提交一个视频自由组队这个视频可以说是费力不讨好尤其不要选择剪辑配音这样的分工 dz 当时每天都濒临崩溃另外有过几次小作业都是极容易完成的基本可以在课堂上解决。\n【考试】开卷考可以用电脑手机等内容前几题是关于期中视频的小简答最后是 400-500 words 的新闻评论难度不大且可借助网络。"
  },
  {
    "id": 48,
    "courseId": "2930228",
    "courseName": "民事司法与纠纷解决",
    "teacher": "曹志勋",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 2,
    "grading": 5,
    "teaching": 4,
    "harvest": 3,
    "content": "【课程体验】非常轻松愉快的一门二类通识课！每节课老师都会抛一个问题和同学们交流，这个交流可以占到每节课的快一半（所以课程不是那种很硬核的风格，反而有点水水的.）整个交流过程也是非常轻松愉快的，本人是一个不爱发言的人，但是整个学期下来自发的和老师探讨了三次 hhh 老师人特别和蔼，每节课都会带一点零食过来和回答问题的同学分享，也非常体谅同学们（你可以在他眼皮子底下写其他课的作业 hhh )\n作业／任务量：无考勤，期中一篇不超过 800 字的论文大纲，期末一篇不超过 5000 字的论文。期中的 ddl 大概在 12 月，期末的 ddl 在放假后 10 天，有充足的时间去完成论文。我感觉老师更喜欢的论文是讨论具体案例、表达自己观点的论文，并不需要很专业。当时选题也给老师发了邮件，老师也特别迅速地给了我一些意见\n得分：97 吹爆曹老师小天使！这样一门无考勤任务量小论文结课给分好的二类通识课不冲还在等什么呢 ovo"
  },
  {
    "id": 49,
    "courseId": "4332210",
    "courseName": "中国电影史",
    "teacher": "李道新",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 2,
    "difficulty": 3,
    "grading": 4,
    "teaching": 3,
    "harvest": 3,
    "content": "【考核】没有纸面的考核方式说明，最后感觉也不是很明晰，实际情况是 4 次签到，占比 20 分（一开始是说签到一共 10 分，但是看洞里好像最后一次非签到考勤扣了 10 分）前 3 次是线下签到，手写回答问题，第一次写了就满分，后面几次看质量给分，最后一次是线上在指定时间内完成问卷；期末论文（课上限时完成）题目不是很难，感觉要求也没有很高，可以用各种资源（上网）\n【内容】按照时间线索介绍了几位导演及其作品，大多数时候会在课堂放电影，一边放一边进行简单讲解。有的时候会放一些导演的访谈或者纪录片。这学期有老电影放映活动，基本每一次有赠票，个人还是挺喜欢看的。前两次放映有签到，后面没有了\n【评价】感觉课上内容可以让大家对中国电影发展有一个大概的了解，但不是特别深入。看纪录片可能收获都会更大。不过老师有的时候讲的一些观点还有讲解还是值得一听的。平时任务量不大，这学期洞内对这门课负面反馈还挺多的，不过大家可以自己斟酌，毕竟挺好水+本人很喜欢老电影"
  },
  {
    "id": 50,
    "courseId": "4330335",
    "courseName": "颗粒艺术",
    "teacher": "王楠",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 5,
    "teaching": 4,
    "harvest": 4,
    "content": "【课程安排】这门课每学期的课程内容不完全相同，dz 只分享自己24-25 春季学期的课程内容作为参考。\n课程的前半部包括：\n1. 对颗粒艺术概念的介绍，对颗粒艺术作品的展示；\n2. 颗粒方游戏（在尽可能短的时间内摆出目标图案，类似益智小游\n戏 hhh）\n3. 集体完成一个颗粒艺术作品；\n4. 利用空间透视摆出立体字（从不同角度看是不同的字）\n后半部分：完成一个自己的颗粒艺术作品王老师人很好，会认真给作品提供 idea 和 advice，做作品的时候遇到任何问题都可以和老师主动交流"
  },
  {
    "id": 51,
    "courseId": "1132688",
    "courseName": "葡萄酒背后的科学与文化",
    "teacher": "彭宜本",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 5,
    "taskLoad": 2,
    "difficulty": 2,
    "grading": 5,
    "teaching": 4,
    "harvest": 3,
    "content": "葡萄酒爱好者必选，每周开酒就是 dz 最幸福的时刻，最多一次开了 8款酒。酒香四溢，老师带着边品酒，边讲述背后的工艺与文化。每次下课，下一堂课的同学进来表情都会很精彩，因为酒味很重 hhh 在这堂课上评鉴了干白、干红、桃红、香槟、贵腐等 30 多款酒，很丰富适合入门。而且这门课还有个好处是公费出游，也就是“酒庄实习”。第一次酒庄实习跑了两家酒庄，一家是入选了世界 Top100 酒庄，一家是新建的酒庄，是庄主为爱发电建的。毕竟葡萄酒这种前期投入高的产业，真的很烧钱，没热爱支撑不下来。两家酒庄的酒都很有意思，而且可以近距离观察葡萄藤、橡木桶、装瓶工艺等，还真是蛮好玩的。课程任务量不高，论文结课，dz 最后拿了 94 分。"
  },
  {
    "id": 52,
    "courseId": "3634030",
    "courseName": "传记文学：经典人物研究",
    "teacher": "赵白生",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 2,
    "teaching": 3,
    "harvest": 4,
    "content": "对于一门通选课来说，参考任务量，拿到了一个我个人不是很满意的分数，85+，当然原因在于我自己没有积极参与课程 pre 的参选竞争，所以想为想选这门课的大家提供一下参考。记起来的任务量大概有几次课堂小测（提前在课程群布置内容，自己看了书去写）、期中随堂一次北大日记（可以提前写好过去誊写，就一页纸的量，很少）、期末手写个人自述（应该一般最少也写个几千字吧）。还有一个几乎每周都可以参选的 pre，提前把大纲发给老师，老师选出两位同学（评选标准我感觉主要是标题的新颖程度，尤其需要有陌生感、高级感的名词，要在标题上能抓人）。对于多次提交大纲但没被选上的同学，老师会在小测里设置题目，争取体现这些同学的努力。对于一个上百人的大课来说最终能够 pre 的同学比例是很少的，但 pre 的给分是5-10 分，参考统分洞可以看到不 pre 似乎上不了 90（当然我不知道多次提交大纲但没被选上的同学的得分情况）。"
  },
  {
    "id": 53,
    "courseId": "4330688",
    "courseName": "艺术与审美",
    "teacher": "彭锋",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 4,
    "harvest": 5,
    "content": "【课程感受】本门课程是一个大拼盘课，总体由学期内 6 次见面课+智慧树网课构成，且涉及到的内容过于宽泛，比如音乐、美术、建筑、雕塑、电影、舞蹈、戏剧…个人的感觉是或许可以帮助没有接触过艺术的同学建立一些关于艺术的基本认知。任务量小。\n【考核方式】智慧树线上【成绩】40%+艺术批评 60%。关于智慧树，分数很细，个人建议务必在开学之初弄清楚平台规则。艺术批评不限制门类、作品，完全自由发挥，但字数需要严格控制在 3000 字以内，个人体感这部分的分数给的比较中庸，认真写就好。总体来看，这门课不太可能拿到 95+，但是 90+不困难，最低也有正态保底，所以性价比还是不错的。"
  },
  {
    "id": 54,
    "courseId": "4330111",
    "courseName": "经典昆曲欣赏",
    "teacher": "陈均",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 4,
    "harvest": 4,
    "content": "喜欢！课程安排是每节课老师发动人脉超能力请不同的昆曲演员来讲座。有机会欣赏到演员们在现场的精湛表演，能直观感受到屏幕上不能完全展示出的生命力。不过也有所有老师都抱着“昆曲普及”的想法，而导致后期课程重复内容多的情况，我也很想了解除了牡丹亭以外的昆曲经典。任务量是期中三项（昆曲活动，课程感想等，也可以当小组长）+期末昆曲观后感（800 还是 1000 来着）。dz 去看了百讲的西厢记后深深爱上了红娘这个角色所以期末论文小卷，写得挺快乐的。最终得分 90+。"
  },
  {
    "id": 55,
    "courseId": "1831760",
    "courseName": "世界电影史",
    "teacher": "陆绍阳",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 4,
    "teaching": 3,
    "harvest": 4,
    "content": "这门课成绩构成是期中论文+期末考试，中间无签到。期末考试前老师会发文字版资料，非常全面，背过基本上考试就够用\n了，如果想要高分就要结合一些理论多分析。老师的授课方式就是ppt 和影片放映结合，节奏比较慢，没有兴趣的话可能稍有无聊。然后期中论文老师会挑好的邀请同学展示。总之这个课上下来听感比较舒适，老师不会给很高的分，但只要背了 85-90 还是比较容易的"
  },
  {
    "id": 56,
    "courseId": "4332350",
    "courseName": "中国流行音乐流变",
    "teacher": "周映辰",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 3,
    "difficulty": 4,
    "grading": 0,
    "teaching": 4,
    "harvest": 4,
    "content": "主要梳理了上世纪中国流行音乐流变，还挺享受的，只是抽名字提问有点让人提心吊胆。平时做个虚假的乐评人装装逼还可以，真的在一百五十人的课堂和专业音乐教授面前鬼扯就有点汗流浃背了，幸好我没被点过。印象最深的是在某节课前听 Soccer Mommy 新专的先行曲 Shotgun，真好啊。以及上课被老师推荐艾敬的《我的 1997》于是一发不可收拾，一天不听浑身难受。以及期中论文给张悬四张专辑写了乐评交上去，不知道老师作何感想"
  },
  {
    "id": 57,
    "courseId": "4331921",
    "courseName": "艺术经典里的百年中国",
    "teacher": "彭锋",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 0,
    "teaching": 3,
    "harvest": 3,
    "content": "【课程听感】每次课的老师不一样，个人认为大部分老师的课中规中矩，少部分老师的课值得听。\n【任务量】期未 3000 字论文。\n【考核】签到缺不超过 4 次+论文交了符合基本要求=p。签到开始是上课时课程群+当场发小程序定位签到，后面变成了课间甚至上课时间发小程序签到，有时会当场面对面建群在群里发小程序签到"
  },
  {
    "id": 58,
    "courseId": "1430950",
    "courseName": "地球环境与人类社会",
    "teacher": "赵永红",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 4,
    "taskLoad": 4,
    "difficulty": 3,
    "grading": 4,
    "teaching": 3,
    "harvest": 4,
    "content": "【课程内容】内容基本是高中地理，得分主要是一次小组 pre（需要交上自己的分工）、一次外出参观报告（对地理环境的考察）、上课回答问题最多+5 分和期末报告（分为 1000 字小论文和对课程的感受）以及自己制作的实践手工（老师会组织一次做酸奶活动，也可以算成是手工），总体下来任务量不大，每节课都会有小组做 pre，课后会用问卷签到。"
  },
  {
    "id": 59,
    "courseId": "1034030",
    "courseName": "魅力化学",
    "teacher": "黄建彬",
    "semester": "",
    "publishDate": "2025-12-24",
    "overallScore": 3,
    "taskLoad": 3,
    "difficulty": 3,
    "grading": 3,
    "teaching": 3,
    "harvest": 4,
    "content": "【上课】拼盘课。每周有一位老师介绍 ta 介绍化学的相关领域的历史、现状与进展等等。算是科普向的课程。\n【作业】这门课是论文结课，随便选择与化学相关的主题写一篇论文就可以。如果被选上优秀论文，还会上台进行 PPT 展示汇报，并由台下同学进行评选，估计会按名次加分。\n【签到】无，但是每节课都有小测。Pre/论文：论文结课，优秀论文有 pre。考试：无期中期末考试，但是每节课都有课堂小测，内容就是老师讲解的课程中随机抽取的，因此上课要认真听。个人感受与推荐情况：助教明确说了不要抄别人的课堂小测答案，论文不要用 gpt写。我论文没有用 gpt，但是可能太像 gpt 了，最后喜提应该是全班最低分。"
  }
]